app/views/items/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."item_id" = 2
SELECT "subitems".* FROM "subitems" WHERE "subitems"."item_id" = 1
SELECT COUNT(*) FROM "items" WHERE "items"."item_id" = 2
SELECT COUNT(*) FROM "subitems" WHERE "subitems"."item_id" = 2
---
  <hr />
  <button class='btn <%= "Hidden" if @item.subitems.count > 0 %>' id='addSubItemsButton'>Add Subitems</button>

SELECT "item_followers".* FROM "item_followers" WHERE "item_followers"."item_id" = 15
---
  <ul id='itemFollowers'>
    <% @item.all_followers.each do |f| %>