app/controllers/items_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "items" ("body", "created_at", "end_at", "item_id", "name", "start_at", "status", "type", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'feifan@me.com' LIMIT 1
INSERT INTO "item_followers" ("created_at", "deferred_to", "is_flagged", "is_read", "item_id", "read_time", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @item = Item.new(params[:item])
    @item.item_id = params[:parent_ID] if (!params[:parent_ID].blank?)
    @user = User.find(params[:creator_ID])
    @item.user_id = params[:creator_ID] if !@user.blank?
    success = @item.save
    if !params[:recipients].blank?
      rec = params[:recipients].split(',')
      rec.each do |r|
        user = nil
        if /\A[\w+\-.]+@[a-z\d\-.]+\.[a-z]+\z/i.match(r.strip.downcase)
          user = User.find_by_email(r.strip.downcase)
        elsif /\d+/.match(r.strip)
          user = User.find(r.strip)
        end
        if !user.blank?
          ItemFollower.create(item_id: @item.id, user_id: user.id, is_read: false)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "items" SET "start_at" = '2013-09-09 12:00:00.000000', "updated_at" = '2013-09-08 05:12:38.517890' WHERE "items"."type" IN ('Task') AND "items"."id" = 1
---
  def update
    @item = Item.find(params[:id])
    @item.status = params[:status] if !params[:status].blank?
    @item.type = params[:item][:type] if !params[:item][:type].blank?
    if !params[:item][:start].blank?
      comps = params[:item][:start].split('-')
      puts comps.to_s
      @item.start_at = DateTime.new(comps[0].to_i, comps[1].to_i, comps[2].to_i, comps[3].to_i, comps[4].to_i, 0)
    end
    if !params[:item][:end].blank?
      comps = params[:item][:end].split('-')
      puts comps.to_s
      @item.end_at = DateTime.new(comps[0].to_i, comps[1].to_i, comps[2].to_i, comps[3].to_i, comps[4].to_i, 0)
    end
    @item.save