app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'feifan@me.com' LIMIT 1
INSERT INTO "users" ("created_at", "email", "fname", "lname", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    if !params[:user][:id].blank?
      flash[:login_error] = "You filled in stuff that shouldn't be. Contact us for help."
      puts '===== Honeypot filled in ====='
      redirect_to login_path
    end
    user = User.find_by_email(params[:user][:email].downcase)
    if user && user.authenticate(params[:user][:password])
      cookies[:current_user] = user.remember_token
      # if user.has_temp_password
      #   redirect_to pwchange_path
      # else
      redirect_to root_path
        # redirect_back
        # redirect_to session[:return_to]
      # end
    else
      if (params[:user][:fname].blank? || params[:user][:lname].blank?)
        flash[:login_error] = 'Could not log you in. Check your email and password.'
        puts '===== Invalid login ====='
        redirect_to login_path
      else
        # Create new user
        @user = User.new(params[:user].except(:id))
        if @user.save