app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def items
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def all_items
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def created_items
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def assigned_items
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def followed_items
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "4"]]
---
  def inbox_items
    @user = User.find(params[:id])